; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v2 ?v7)
             (pred_7 ?v5 ?v13)
             (pred_8 ?v2 ?v13)
             (pred_4 ?v11 ?v2 )
	     (pred_11 ?v2)
             (pred_5 ?v6)
             (pred_3 ?v5)
             (pred_9 ?v13)
             (pred_2 ?v2)
             (pred_6 ?v5)
             (pred_1 ?v2)
             (pred_10 ))



(:action op_4
:parameters (?v1 ?v4 ?v3 ?v12)
:precondition (and (pred_5 ?v1) (pred_5 ?v4) (pred_3 ?v3) (pred_9 ?v12)
          (pred_12 ?v1 ?v4) (pred_7 ?v3 ?v12)
                   (pred_8 ?v4 ?v12) (pred_11 ?v1) 
                   (pred_2 ?v4) (pred_6 ?v3))
:effect (and  (pred_1 ?v4) (not (pred_2 ?v4))))


(:action op_5
:parameters (?v1 ?v9)
:precondition (and (pred_5 ?v1) (pred_5 ?v9)
               (pred_11 ?v1) (pred_12 ?v1 ?v9) (pred_1 ?v9))
:effect (and (pred_11 ?v9) (not (pred_11 ?v1))))

(:action op_1
:parameters (?v1 ?v3)
:precondition (and (pred_5 ?v1) (pred_3 ?v3) 
                  (pred_11 ?v1) (pred_4 ?v3 ?v1) (pred_10 ))
:effect (and (pred_6 ?v3)
   (not (pred_4 ?v3 ?v1)) (not (pred_10 ))))


(:action op_3
:parameters (?v1 ?v8 ?v10)
:precondition (and (pred_5 ?v1) (pred_3 ?v8) (pred_3 ?v10)
                  (pred_11 ?v1) (pred_6 ?v10) (pred_4 ?v8 ?v1))
:effect (and (pred_6 ?v8) (pred_4 ?v10 ?v1)
        (not (pred_6 ?v10)) (not (pred_4 ?v8 ?v1))))

(:action op_2
:parameters (?v1 ?v3)
:precondition (and (pred_5 ?v1) (pred_3 ?v3) 
                  (pred_11 ?v1) (pred_6 ?v3))
:effect (and (pred_10 ) (pred_4 ?v3 ?v1) (not (pred_6 ?v3)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_19 obj_10 obj_06 obj_11 obj_12 obj_21 obj_08 obj_13 obj_15 obj_01 obj_17 obj_20 obj_07 obj_02 obj_14 obj_04
    obj_09 obj_03
    obj_18 obj_05 obj_16
    )

    (:init
       (pred_10)

       (pred_5 obj_19)
       (pred_5 obj_10)
       (pred_5 obj_06)
       (pred_5 obj_11)
       (pred_5 obj_12)
       (pred_5 obj_21)
       (pred_5 obj_08)
       (pred_5 obj_13)
       (pred_5 obj_15)
       (pred_5 obj_01)
       (pred_5 obj_17)
       (pred_5 obj_20)
       (pred_5 obj_07)
       (pred_5 obj_02)
       (pred_5 obj_14)
       (pred_5 obj_04)
       (pred_9 obj_09)
       (pred_9 obj_03)
       (pred_3 obj_18)
       (pred_3 obj_05)
       (pred_3 obj_16)

       (pred_12 obj_19 obj_12)
       (pred_12 obj_19 obj_10)
       (pred_12 obj_10 obj_21)
       (pred_12 obj_10 obj_06)
       (pred_12 obj_10 obj_19)
       (pred_12 obj_06 obj_08)
       (pred_12 obj_06 obj_11)
       (pred_12 obj_06 obj_10)
       (pred_12 obj_11 obj_13)
       (pred_12 obj_11 obj_06)
       (pred_12 obj_12 obj_15)
       (pred_12 obj_12 obj_21)
       (pred_12 obj_12 obj_19)
       (pred_12 obj_21 obj_01)
       (pred_12 obj_21 obj_08)
       (pred_12 obj_21 obj_10)
       (pred_12 obj_21 obj_12)
       (pred_12 obj_08 obj_17)
       (pred_12 obj_08 obj_13)
       (pred_12 obj_08 obj_06)
       (pred_12 obj_08 obj_21)
       (pred_12 obj_13 obj_20)
       (pred_12 obj_13 obj_11)
       (pred_12 obj_13 obj_08)
       (pred_12 obj_15 obj_07)
       (pred_12 obj_15 obj_01)
       (pred_12 obj_15 obj_12)
       (pred_12 obj_01 obj_02)
       (pred_12 obj_01 obj_17)
       (pred_12 obj_01 obj_21)
       (pred_12 obj_01 obj_15)
       (pred_12 obj_17 obj_14)
       (pred_12 obj_17 obj_20)
       (pred_12 obj_17 obj_08)
       (pred_12 obj_17 obj_01)
       (pred_12 obj_20 obj_04)
       (pred_12 obj_20 obj_13)
       (pred_12 obj_20 obj_17)
       (pred_12 obj_07 obj_02)
       (pred_12 obj_07 obj_15)
       (pred_12 obj_02 obj_14)
       (pred_12 obj_02 obj_01)
       (pred_12 obj_02 obj_07)
       (pred_12 obj_14 obj_04)
       (pred_12 obj_14 obj_17)
       (pred_12 obj_14 obj_02)
       (pred_12 obj_04 obj_20)
       (pred_12 obj_04 obj_14)
       (pred_2 obj_20)
       (pred_2 obj_21)
       (pred_2 obj_04)
       (pred_8  obj_20 obj_09)
       (pred_8  obj_21 obj_03)
       (pred_8  obj_04 obj_03)
       (pred_1 obj_19)
       (pred_1 obj_10)
       (pred_1 obj_06)
       (pred_1 obj_11)
       (pred_1 obj_12)
       (pred_1 obj_08)
       (pred_1 obj_13)
       (pred_1 obj_15)
       (pred_1 obj_01)
       (pred_1 obj_17)
       (pred_1 obj_07)
       (pred_1 obj_02)
       (pred_1 obj_14)

       (pred_7  obj_18 obj_09)
       (pred_7  obj_05 obj_03)
       (pred_7  obj_16 obj_03)
       (pred_4 obj_18 obj_13)
       (pred_4 obj_05 obj_02)
       (pred_4 obj_16 obj_19)
       (pred_11 obj_17)
    )

    (:goal (and
       (pred_4 obj_18 obj_20)
    ))
(:constraints
  (always (not (pred_11 obj_08)))
)
)

; plan
1. (op_5 obj_17 obj_01)
   deleted: (pred_11 obj_17)
   added: (pred_11 obj_01)
   goals met: 0 of 1
2. (op_5 obj_01 obj_15)
   deleted: (pred_11 obj_01)
   added: (pred_11 obj_15)
   goals met: 0 of 1
3. (op_5 obj_15 obj_12)
   deleted: (pred_11 obj_15)
   added: (pred_11 obj_12)
   goals met: 0 of 1
4. (op_5 obj_12 obj_19)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_19)
   goals met: 0 of 1
5. (op_5 obj_19 obj_10)
   deleted: (pred_11 obj_19)
   added: (pred_11 obj_10)
   goals met: 0 of 1
6. (op_5 obj_10 obj_06)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_06)
   goals met: 0 of 1
7. (op_5 obj_06 obj_11)
   deleted: (pred_11 obj_06)
   added: (pred_11 obj_11)
   goals met: 0 of 1
8. (op_5 obj_11 obj_13)
   deleted: (pred_11 obj_11)
   added: (pred_11 obj_13)
   goals met: 0 of 1
9. (op_1 obj_13 obj_18)
   deleted: (pred_4 obj_18 obj_13) (pred_10)
   added: (pred_6 obj_18)
   goals met: 0 of 1
10. (op_4 obj_13 obj_20 obj_18 obj_09)
   deleted: (pred_2 obj_20)
   added: (pred_1 obj_20)
   goals met: 0 of 1
11. (op_5 obj_13 obj_20)
   deleted: (pred_11 obj_13)
   added: (pred_11 obj_20)
   goals met: 0 of 1
12. (op_2 obj_20 obj_18)
   deleted: (pred_6 obj_18)
   added: (pred_10) (pred_4 obj_18 obj_20)
   goals met: 1 of 1
